In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [203]:
import plotly.offline as pyo
import plotly.graph_objs as go
import plotly.figure_factory as ff
from plotly.offline import download_plotlyjs, init_notebook_mode, plot, iplot
init_notebook_mode(connected=True)

In [34]:
df = pd.read_excel(r'C:\Users\Mi Notebook\Desktop\billionaires_2018.xlsx')

In [35]:
df.head()

,Rank,Name,Net Worth,Age,Source,Country of Citizenship
0,#1,Jeff Bezos,$112 B,54,Amazon,United States
1,#2,Bill Gates,$90 B,62,Microsoft,United States
2,#3,Warren Buffett,$84 B,87,Berkshire Hathaway,United States
3,#4,Bernard Arnault,$72 B,69,LVMH,France
4,#5,Mark Zuckerberg,$71 B,34,Facebook,United States

In [36]:
df['Net Worth'] = df['Net Worth'].str.replace('$', '')

In [37]:
df['Net Worth'] = df['Net Worth'].str.replace(' B', '')

In [38]:
df['Net Worth'] = df['Net Worth'].astype(float)

In [32]:
df['Age'] = df['Age'].str.replace('-', '')

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2116 entries, 0 to 2115
Data columns (total 6 columns):
Rank                      2110 non-null object
Name                      2110 non-null object
Net Worth                 2110 non-null float64
Age                       2110 non-null object
Source                    2110 non-null object
Country of Citizenship    2110 non-null object
dtypes: float64(1), object(5)
memory usage: 99.3+ KB

In [62]:
df.loc[df['Age']=='-']['Age'] = '0'

C:\Users\Mi Notebook\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [66]:
df[df['Age']=='-']['Age'] = df[df['Age']=='-']['Age'].replace('-', '0')

C:\Users\Mi Notebook\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [73]:
listin = df['Age']

In [81]:
listin = list(listin)

In [85]:
for_change = [0 if x == '-' else x for x in listin]

In [87]:
df['AGE']= for_change

In [92]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2116 entries, 0 to 2115
Data columns (total 7 columns):
Rank                      2110 non-null object
Name                      2110 non-null object
Net Worth                 2110 non-null float64
Age                       2110 non-null object
Source                    2110 non-null object
Country of Citizenship    2110 non-null object
AGE                       2110 non-null float64
dtypes: float64(2), object(5)
memory usage: 115.8+ KB

In [94]:
df.drop('Age', axis= 1, inplace=True)

In [95]:
df.head()

,Rank,Name,Net Worth,Source,Country of Citizenship,AGE
0,#1,Jeff Bezos,112.0,Amazon,United States,54.0
1,#2,Bill Gates,90.0,Microsoft,United States,62.0
2,#3,Warren Buffett,84.0,Berkshire Hathaway,United States,87.0
3,#4,Bernard Arnault,72.0,LVMH,France,69.0
4,#5,Mark Zuckerberg,71.0,Facebook,United States,34.0

In [204]:
countries_code = pd.read_csv('https://raw.githubusercontent.com/plotly/datasets/master/2014_world_gdp_with_codes.csv')

In [205]:
countries_code.drop('GDP (BILLIONS)', axis = 1, inplace=True)

In [105]:
table = df.groupby('Country of Citizenship')['Net Worth'].agg('sum').sort_values(ascending=False)

In [182]:
table1 = df.groupby('Country of Citizenship').agg({'Net Worth': 'sum', 'Name': 'count', 'AGE': 'mean'})

In [183]:
table1 = table1.reset_index()

In [185]:
table1 = table1.merge(countries_code, how='inner', left_on='Country of Citizenship', right_on='COUNTRY')

In [199]:
table1['AGE'] = table1['AGE'].astype(int)

In [190]:
table1.drop('Country of Citizenship', axis = 1, inplace=True)

In [200]:
table1['text'] = table1['COUNTRY'].astype(str) + '<br>' + '# of Billioners: ' + table1['Name'].astype(str) + '<br>' + 'Average Age: ' + table1['AGE'].astype(str)

In [201]:
table1.head()

,Net Worth,Name,AGE,COUNTRY,CODE,text
0,4.0,1,74,Algeria,DZA,Algeria<br># of Billioners: 1<br>Average Age: 74
1,2.6,1,45,Angola,AGO,Angola<br># of Billioners: 1<br>Average Age: 45
2,15.6,9,65,Argentina,ARG,Argentina<br># of Billioners: 9<br>Average Age...
3,114.9,40,65,Australia,AUS,Australia<br># of Billioners: 40<br>Average Ag...
4,43.4,8,67,Austria,AUT,Austria<br># of Billioners: 8<br>Average Age: 67

In [202]:
data = [ dict(
        type = 'choropleth',
        locations = table1['CODE'],
        z = table1['Net Worth'],
        text = table1['text'],
        colorscale = 'heatmap',
        autocolorscale = False,
        reversescale = False,
        marker = dict(
            line = dict (
                color = 'rgb(180,180,180)',
                width = 0.5
            ) ),
        colorbar = dict(title = 'Net Worth in bln US Dollars'),
      ) ]

layout = dict(
    title = 'Billioners Total Capital per Country',
    geo = dict(
        showframe = False,
        showcoastlines = False,
        projection = dict(
            type = 'Mercator'
        )
    )
)

fig = dict( data=data, layout=layout )
plot(fig, validate=False, filename='metgqpscs1.html')

'file://C:\\Users\\Mi Notebook\\metgqpscs1.html'